In [1]:
import pandas as pd

In [3]:
var=pd.DataFrame({'a':[1,2,3,4],'b':[2,3,6,5]})
var

   a  b
0  1  2
1  2  3
2  3  6
3  4  5

In [10]:
var['c']=var['a']-var['b']
var

   a  b  c  sum
0  1  2 -1    3
1  2  3 -1    5
2  3  6 -3    9
3  4  5 -1    9

In [11]:
var['sum']=var['a']+var['b']
var

   a  b  c  sum
0  1  2 -1    3
1  2  3 -1    5
2  3  6 -3    9
3  4  5 -1    9

In [12]:
df=pd.DataFrame({'a':[10,20,13,14],'b':[26,13,66,50]})
df['data']=df['b']<=20
df

    a   b   data
0  10  26  False
1  20  13   True
2  13  66  False
3  14  50  False

In [13]:
df=pd.DataFrame({'a':[10,20,13,14],'b':[26,13,66,50]})
df['data_1']=df['a']>=12
df

    a   b  data_1
0  10  26   False
1  20  13    True
2  13  66    True
3  14  50    True

## insert

In [21]:
var=pd.DataFrame({'A':[1,2,3,4,5],'B':[5,6,7,8,9]})
# insert data using the index positions as a new column 
# we duplicated the A column

# var.insert(1,'new_col',var['A'])
var.insert(1,'new_col',[11,12,13,14,15])


var

   A  new_col  B
0  1       11  5
1  2       12  6
2  3       13  7
3  4       14  8
4  5       15  9

In [22]:
var['python']=var['A'][2:]

In [23]:
var

   A  new_col  B  python
0  1       11  5     NaN
1  2       12  6     NaN
2  3       13  7     3.0
3  4       14  8     4.0
4  5       15  9     5.0

## delete

In [27]:

var_del=var.pop('B')
print(var)

   new_col  python
0       11     NaN
1       12     NaN
2       13     3.0
3       14     4.0
4       15     5.0

In [28]:
del var['python']
var

   new_col
0       11
1       12
2       13
3       14
4       15

## creating csv

In [37]:

o_dict = {'a': [12, 3, 23, 12.23], 'b': [True, False, True, False], 'c': ['a', 'b', 'c','d']}
dis=pd.DataFrame(o_dict)

In [38]:
dis.to_csv('Test_new.csv')

In [42]:
# if we dont want to create a index numbers
dis.to_csv('Test_new1.csv',index=False)

In [44]:
# file with custom header
dis.to_csv('Test_new2.csv',index=False,header=['header 1','header 2','header 3'])